; domain
(define (domain blocksworld)
  (:requirements :strips :typing)
  (:types block hand - object
          stickyh slippery - hand)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty ?h - hand)
	       (holding ?h - hand ?x - block)
               (movable ?x - block)
               (sticky ?x - block)
	       )

  (:action pick-up-sl
	     :parameters (?x - block ?h - slippery)
	     :precondition (and (clear ?x) (ontable ?x) (handempty ?h)(movable ?x))
	     :effect
	     (and  
                   (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty ?h))
		   (holding ?h ?x)))

  (:action pick-up-st
	     :parameters (?x - block ?h - stickyh)
	     :precondition (and (clear ?x) (ontable ?x) (handempty ?h)(movable ?x))
	     :effect
	     (and  
                   (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty ?h))
		   (holding ?h ?x)
                   (sticky ?x)
                      ))

  (:action put-down
	     :parameters (?x - block ?h - hand)
	     :precondition (and (holding ?h ?x))
	     :effect
	     (and (not (holding ?h ?x))
		   (clear ?x)
		   (handempty ?h)
		   (ontable ?x)))

  (:action stack
	     :parameters (?x - block ?y - block ?h - hand)
	     :precondition (and (holding ?h ?x) (clear ?y))
	     :effect
	     (and (not (holding ?h ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty ?h)
		   (on ?x ?y)))

  (:action unstack-sl
	     :parameters (?x - block ?y - block ?h - slippery)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty ?h)(movable ?x))
	     :effect
	     (and  
                   (holding ?h ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty ?h))
		   (not (on ?x ?y))))

  (:action unstack-st
	     :parameters (?x - block ?y - block ?h - stickyh)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty ?h)(movable ?x))
	     :effect
	     (and  
                   (holding ?h ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty ?h))
		   (not (on ?x ?y))
                   (sticky ?x)))


)

; problem
(define (problem BW-rand-5)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5  - block
          h1 - slippery
          h2 - stickyh)
(:init
(handempty h1)
(handempty h2)
(on b1 b2)
(on b2 b4)
(ontable b3)
(ontable b4)
(on b5 b3)
(clear b1)
(clear b5)
(movable b1)
(movable b2)
(movable b3)
(movable b4)
(movable b5)
)
(:goal
(and
(on b1 b4)
(on b2 b5)
(on b3 b1)
(on b5 b3))
)
)

; plan
1. (unstack-st b1 b2 h2)
   deleted: (clear b1) (handempty h2) (on b1 b2)
   added: (holding h2 b1) (clear b2) (sticky b1)
   goals met: 1 of 4
2. (unstack-sl b2 b4 h1)
   deleted: (clear b2) (handempty h1) (on b2 b4)
   added: (holding h1 b2) (clear b4)
   goals met: 1 of 4
3. (stack b1 b4 h2)
   deleted: (holding h2 b1) (clear b4)
   added: (clear b1) (handempty h2) (on b1 b4)
   goals met: 2 of 4
4. (unstack-st b5 b3 h2)
   deleted: (clear b5) (handempty h2) (on b5 b3)
   added: (holding h2 b5) (clear b3) (sticky b5)
   goals met: 1 of 4
5. (put-down b5 h2)
   deleted: (holding h2 b5)
   added: (clear b5) (handempty h2) (ontable b5)
   goals met: 1 of 4
6. (stack b2 b5 h1)
   deleted: (holding h1 b2) (clear b5)
   added: (clear b2) (handempty h1) (on b2 b5)
   goals met: 2 of 4
7. (pick-up-sl b3 h1)
   deleted: (ontable b3) (clear b3) (handempty h1)
   added: (holding h1 b3)
   goals met: 2 of 4
8. (stack b3 b1 h1)
   deleted: (holding h1 b3) (clear b1)
   added: (clear b3) (handempty h1) (on b3 b1)
   goals met: 3 of 4
9. (unstack-sl b2 b5 h1)
   deleted: (clear b2) (handempty h1) (on b2 b5)
   added: (holding h1 b2) (clear b5)
   goals met: 2 of 4
10. (put-down b2 h1)
   deleted: (holding h1 b2)
   added: (clear b2) (handempty h1) (ontable b2)
   goals met: 2 of 4
11. (pick-up-sl b5 h1)
   deleted: (ontable b5) (clear b5) (handempty h1)
   added: (holding h1 b5)
   goals met: 2 of 4
12. (stack b5 b3 h1)
   deleted: (holding h1 b5) (clear b3)
   added: (clear b5) (handempty h1) (on b5 b3)
   goals met: 3 of 4
13. (pick-up-sl b2 h1)
   deleted: (ontable b2) (clear b2) (handempty h1)
   added: (holding h1 b2)
   goals met: 3 of 4
14. (stack b2 b5 h1)
   deleted: (holding h1 b2) (clear b5)
   added: (clear b2) (handempty h1) (on b2 b5)
   goals met: 4 of 4
